REGIONS_AND_LOCATIONS = {
    "Акмолинская область": [
        "Акколь", "Барап", "Больше-Тюктинское", "Букпа", "Ерейментауское",
        "Кенесское", "Красноборское", "Куйбышевское", "Мало-Тюктинское",
        "Маралдинское", "Отрадненское", "Степногорское", "Урумкайское",
        "Бурабай ГНПП", "Буйратау ГНПП", "Кокшетау ГНПП",
        "РГКП Республиканский лесной селекционно-семеноводческий центр",
        "Сандыктауское учебно-производственное лесное хозяйство",
        "РГП на ПХВ Жасыл Аймақ", "Коргалжинский ГПЗ", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Актюбинская область": [
        "Актюбинское", "Больше-Барсукское", "Карабутакское", "Мартукское",
        "Темирское", "Уилское", "Хобдинское", "Иргиз-Тургайский ГПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Алматинская область": [
        "Баканасское", "Каскеленское", "Кегенское", "Куртинское",
        "Нарынкольское", "Кара Дала", "Шелекское", "«Кызыл жиде»",
        "Алматинский ГПЗ", "Иле-Алатауский ГНПП", "«Көлсай көлдері» ГНПП", "Чарынский ГНПП","Иле-Балхаш ГПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Атырауская область": [
        "Атырауское", "Махамбетское", "Индерское", "Курмангазинское",
        "«Ақжайық» ГПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»" 
    ],
    "Восточно-Казахстанская область": [
        "Асубулакское", "Больше-Нарымское", "Верх-Убинское", "Зайсанское",
        "Зыряновское", "Курчумское", "Мало-Убинское", "Маркакольское", "Пихтовское", "Риддерское", 
        "Самарское", "Усть-Каменогорское", "Черемшанское", "Западно- Алтайский ГПЗ", "Маркакольский ГПЗ", "Катон-Карагайский ГНПП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Жамбылская область": [
        "Аккольское", "Акыртюбинское", "Байзакское", "Бурылбайталское",
        "Жамбылское", "Жуалынское", "Каракунузское", "Коктерекское", "Кордайское",
        "Коскудукское", "Луговское", "Меркенское", "Мойынкумское", "Сарысуское", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Область Жетысу": [
        "Алакольское", "Борлитобинское", "Жаркентское", "Капальскае",
        "Талдыкорганское", "Уйгентасское", "Уштобинское", "Алакольский ГПЗ",
        "«Алтын-Эмель» ГНПП", "Жонгар- Алатауский ГНПП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Западно-Казахстанская область": [
        "Акжаикское", "Бурлинское", "Тайпакское", "Уральское",
        "Урдинское", "Чапаевское", "Чингирлауское", "Январцевское", "«Бөкейорда» ГПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Карагандинская область": [
        "Актогайское", "Карагандинское", "Кувское", "Темиртауское",
        "«Буйратау» ГНПП", "Каркаралинский ГНПП", "Коргалжинский ГПЗ", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Костанайская область": [
        "Аракарагайское", "Басаманское", "Боровское", "Камыстинское",
        "Михайловское", "Пригородное", "Семиозерное", "Тарановское", "Узункольское",
        "Урицкое", "Усаковское", "Наурзумский ГПЗ", "Алтын Дала ГПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"        
    ],
    "Кызылординская область": [
        "Аральское", "Жалагашское", "Жанакорганское", "Казалинское",
        "Кармакчинское", "Кызылординское", "Сырдарьинское", "Шиелийское", "Барсакельмесский ГПЗ", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Мангыстауская область": [
        "Бейнеуское", "Самское", "Устюртский ГПЗ", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Павлодарская область": [
        "Максимо-Горьковское", "Павлодарское", "Урлютюбское", "Баянаульский ГНПП",
        "«Ертис орманы» ГЛПР", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Северо-Казахстанская область": [
        "«Акан-Сері»", "Аккайынское", "Булаевское", "Бурлукское",
        "Есильское", "Жамбылское", "Кызылжарское", "Мамлютское", "Орлиногорское",
        "Пресновское", "Сергеевское", "Соколовское", "«Кокшетау» ГНПП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"        
    ],
    "Область Улытау": [
        "Жанаркинское", "«Улытау» ГНПП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Туркестанская область": [
        "Бадамское", "Жасыл желек", "Отрарское", "Созакское",
        "Шардаринское", "Жасыл аймак", "Жасыл белдеу", "Каратауский ГПЗ", 
        "Сайрам-Угамский ГНПП", "Аксу-Жабаглинский ГПЗ", "Сырдарья-Туркестанский ГРП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ],
    "Область Абай": [
        "«Семей орманы» ГЛПР", "Тарбагатайский ГНПП", "АО НК «КТЖ»", "АО НК «КазАвтоЖол»"
    ]
  
}
